app/controllers/api/users_controller.rb

  def show

  	@user = User.find_by(:username => params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "hello"]]